{"description": null, "readme": "Welcome to the comma.ai Calibration Challenge!\n======\n\nYour goal is to predict the direction of travel (in camera frame) from provided dashcam video.\n\n- This repo provides 10 videos. Every video is 1min long and 20 fps.\n- 5 videos are labeled with a 2D array describing the direction of travel at every frame of the video\n  with a pitch and yaw angle in radians.\n- 5 videos are unlabeled. It is your task to generate the labels for them.\n- The example labels are generated using a Neural Network, and the labels were confirmed with a SLAM algorithm.\n- You can estimate the focal length to be 910 pixels.\n\n\n![picture](https://user-images.githubusercontent.com/6804392/116619874-e78a8180-a8f5-11eb-93e3-c9c852726db8.png)\n\nContext\n------\nThe devices that run [openpilot](https://github.com/commaai/openpilot/) are not mounted perfectly. The camera\nis not exactly aligned to the vehicle. There is some pitch and yaw angle between the camera of the device and\nthe vehicle, which can vary between installations. Estimating these angles is essential for accurate control\nof the vehicle. The best way to start estimating these values is to predict the direction of motion in camera\nframe. More info  can be found in [this readme](https://github.com/commaai/openpilot/tree/master/common/transformations).\n\nDeliverable\n-----\n\nYour deliverable is the 5 labels called 5.txt to 9.txt. These labels should be a 2D array that contains\nthe pitch and yaw angles of the direction of travel (in camera frame) of every frame of the respective videos.\nZip them up and e-mail it to givemeajob@comma.ai.\n\n\nEvaluation\n-----\n\nWe will evaluate your mean squared error against our ground truth labels. Errors for frames where the car\nspeed is less than 4m/s will be ignored. Those are also labeled as NaN in the example labels.\n\nThis repo includes an eval script that will give an error score (lower is better). You can use it to test your\nsolutions against the labeled examples. We will use this script to evaluate your solution. \n\n\nHints\n------\n- Keep the goal and evaluation script in mind, creative solutions are allowed.\n- Look at plots of your solutions before submitting.\n- The dataset is tiny, use caution if using ML.\n\n\n<s> $500 Prize </s> CLAIMED\n------\nThe first submission that scores an error under 25% on the unlabeled set, will receive a $500 prize.\n", "prev_commits": ["model arch", "more sane cross validation", "variational", "idk", "ignore zips", "submission", "i have a score?", "checkpointing", "checkpointing is hard", "validation loss", "training script", "delete exploration scripts", "model arch", "create dataloader", "some work idk"], "title": "comma_calib_challenge", "owner": "sagarreddypatil", "commits": 15}